templates/blog_templates/PCA.html
{% extends 'blog_templates/base.html' %}
{% block title %}Principal Component Analysis {% endblock %}
{% block page_content %}
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>

<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Principal Component Analysis"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2015-03-04T11:10-0500"/>
<meta name="author" content="Jiaxuan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Principal Component Analysis</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Projection matrix</a></li>
<li><a href="#sec-2">2 PCA</a>
<ul>
<li><a href="#sec-2-1">2.1 Maximizing variance along principal component direction</a></li>
<li><a href="#sec-2-2">2.2 Minimizing reconstruction error (TOBE written)</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Eigen Vector Decomposition</a></li>
<li><a href="#sec-4">4 SVD</a>
<ul>
<li><a href="#sec-4-1">4.1 proof of SVD's properties (TOBE written)</a></li>
<li><a href="#sec-4-2">4.2 relation with PCA</a></li>
</ul>
</li>
<li><a href="#sec-5">5 LSA</a>
<ul>
<li><a href="#sec-5-1">5.1 turn a sparse matrix into dense matrix</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Projection matrix</h2>
<div class="outline-text-2" id="text-1">

<p>  \begin{equation}
  \theta = (A^tA)A^tX
  \end{equation}
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> PCA</h2>
<div class="outline-text-2" id="text-2">

<p>  PCA stands for principal component analysis. It is a major tool for dimensionality reduction in
  machine learning and statistics. The core idea, like most other dimensionality reduction techniques,
  is to restrict the column rank of a matrix so that unimportant details are thrown away. Here I derive
  PCA from 2 perspectives, hopefully the Eureka moment will come to you after reading this post.
</p>
</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Maximizing variance along principal component direction</h3>
<div class="outline-text-3" id="text-2-1">

<p>   The objective function to maximize is
   \begin{equation}
   \mathbb{E}(( x \cdot u - \mathbb{E}(x \cdot u))^2)
   \end{equation}
   where \(u\) is a principal component (assuming orthonormal) and \(x\) is a data point
</p>
<p>   
   The above formulae can be reduced to the following form
   \begin{equation}
   u^t \mathbb{E}( (x-\mathbb{E}) (x-\mathbb{E})^t ) u
   \end{equation}
</p>
<p>   
   where \(\mathbb{E}( (x-\mathbb{E}) (x-\mathbb{E})^t )\) is the second moment matrix (also sample
   variance matrix)
</p>
<p>   
   TOBE finished:
   \begin{equation}
   \mathbb{E}( (x-\mathbb{E}) (x-\mathbb{E})^t ) = X X^t
   \end{equation}
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Minimizing reconstruction error (TOBE written)</h3>
<div class="outline-text-3" id="text-2-2">


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Eigen Vector Decomposition</h2>
<div class="outline-text-2" id="text-3">

<p>  TOBE wirtten
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> SVD</h2>
<div class="outline-text-2" id="text-4">

<p>  SVD stands for singular value decomposition. It is a powerful technique that links the nullspace, 
  the column space, the row space, and the kernel of \(A^t\) together (\(A\) being an arbitrary matrix).
  \begin{equation}
  A = U \Sigma V^t
  \end{equation}
  where A is a matrix we want to decompose, U a matrix with columns eigenvectors of \(A A^t\), and V a
  matrix with columns eigenvectors of \(A^t A\).
</p>

</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> proof of SVD's properties (TOBE written)</h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>U is a matrix with columns eigenvectors of \(A A^t\)
</li>
</ul>

<p>   \begin{equation}
   A A^t = (U \Sigma V^t) (U \Sigma V^t)^t = U \Sigma^2 U^t
   \end{equation}
   From the above equation, it should be clear that U is the matrix having the eigenvectors of AA' as columns
</p>
<ul>
<li>V is a matrix with columns eigenvectors of \(A^t A\)
</li>
</ul>

<p>   \begin{equation}
   A^t A = (U \Sigma V^t)^t (U \Sigma V^t) = V \Sigma^2 V^t
   \end{equation}
   From the above equation, it should be clear that V is the matrix having the eigenvectors of A'A as columns
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> relation with PCA</h3>
<div class="outline-text-3" id="text-4-2">

<p>U = eigenvector of \(A A^t\)
V = eigenvector of \(A^t A\)
</p>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> LSA</h2>
<div class="outline-text-2" id="text-5">

<p>  latent syntax analysis
  TOBE written
</p>
</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> turn a sparse matrix into dense matrix</h3>
<div class="outline-text-3" id="text-5-1">

<p>   TOBE written
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2015-03-04T11:10-0500</p>
<p class="author">Author: Jiaxuan</p>

</div>
</body>
</html>

{% endblock %}
